Repository: LuicdLabs/OneMMC
Catalog: src/OneMMC/Strings/*/AzMan.resw
Source language: en_us
Languages: zh_tw

# BizRuleEditorDialog_Message_ImportSuccess
source: Script imported from '{0}'.
zh_tw: 腳本已從 '{0}' 匯入。

# BizRuleEditorDialog_Title_ImportSuccess
source: Import Successful
zh_tw: 匯入成功

# BizRuleEditorDialog_Message_ImportFailed
source: Failed to import script: {0}
zh_tw: 匯入腳本失敗：{0}

# BizRuleEditorDialog_Title_ImportFailed
source: Import Failed
zh_tw: 匯入失敗

# BizRuleEditorDialog_Message_NoScriptToExport
source: No script to export.
zh_tw: 沒有腳本可匯出。

# BizRuleEditorDialog_Title_Export
source: Export Script
zh_tw: 匯出腳本

# BizRuleEditorDialog_Message_ExportSuccess
source: Script exported to '{0}'.
zh_tw: 腳本已匯出到 '{0}'。

# BizRuleEditorDialog_Title_ExportSuccess
source: Export Successful
zh_tw: 匯出成功

# BizRuleEditorDialog_Message_ExportFailed
source: Failed to export script: {0}
zh_tw: 匯出腳本失敗：{0}

# BizRuleEditorDialog_Title_ExportFailed
source: Export Failed
zh_tw: 匯出失敗

# BizRuleEditorDialog_Message_ValidationSuccess
source: Script validation successful. No errors found.
zh_tw: 腳本驗證成功。未發現錯誤。

# BizRuleEditorDialog_Message_ValidationSuccessWithWarnings
source: Script validation successful with {0} warning(s).
zh_tw: 腳本驗證成功，但有 {0} 則警告。

# BizRuleEditorDialog_Message_ValidationFailed
source: Script validation failed with {0} error(s).
zh_tw: 腳本驗證失敗，發現 {0} 個錯誤。

# BizRuleEditorDialog_Title_Validation
source: Validation
zh_tw: 驗證

# BizRuleEditorDialog_Message_ValidationFixBeforeSave
source: Please fix validation errors before saving.
zh_tw: 請在儲存前修正驗證錯誤。

# BizRuleEditorDialog_Title_ValidationError
source: Validation Error
zh_tw: 驗證錯誤

# BizRuleEditorDialog_FileType_JScript
source: JScript Files
zh_tw: JScript 檔案

# BizRuleEditorDialog_FileType_VBScript
source: VBScript Files
zh_tw: VBScript 檔案

# BizRuleEditorDialog_FileType_TextFiles
source: Text Files
zh_tw: 文字檔案

# AuthApplicationsPage_AssignItems_RoleDefinitionFormat
source: Role Definition: {0}
zh_tw: 角色定義：{0}

# AuthApplicationsPage_AssignItems_TaskFormat
source: Task: {0}
zh_tw: 任務：{0}

# AuthApplicationsPage_DeleteApplication
source: Delete Application
zh_tw: 刪除應用程式

# AuthApplicationsPage_DeleteApplication_Content
source: Are you sure you want to delete this application?
zh_tw: 您確定要刪除此應用程式嗎？

# AuthApplicationsPage_DeleteApplication_Title
source: Delete Application
zh_tw: 刪除應用程式

# AuthApplicationsPage_DeleteGroup_Content
source: Are you sure you want to delete this group?
zh_tw: 您確定要刪除此群組嗎？

# AuthApplicationsPage_DeleteGroup_Title
source: Delete Group
zh_tw: 刪除群組

# AuthApplicationsPage_DeleteOperation_Content
source: Are you sure you want to delete this operation?
zh_tw: 您確定要刪除此操作嗎？

# AuthApplicationsPage_DeleteOperation_Title
source: Delete Operation
zh_tw: 刪除操作

# AuthApplicationsPage_DeleteRole_Content
source: Are you sure you want to delete this role?
zh_tw: 您確定要刪除此角色嗎？

# AuthApplicationsPage_DeleteRole_Title
source: Delete Role
zh_tw: 刪除角色

# AuthApplicationsPage_DeleteRoleAssignment_Content
source: Are you sure you want to delete this role assignment?
zh_tw: 您確定要刪除此角色指派嗎？

# AuthApplicationsPage_DeleteRoleAssignment_Title
source: Delete Role Assignment
zh_tw: 刪除角色指派

# AuthApplicationsPage_DeleteScope_Content
source: Are you sure you want to delete this scope?
zh_tw: 您確定要刪除此範圍嗎？

# AuthApplicationsPage_DeleteScope_Title
source: Delete Scope
zh_tw: 刪除範圍

# AuthApplicationsPage_DeleteTask_Content
source: Are you sure you want to delete this task?
zh_tw: 您確定要刪除此任務嗎？

# AuthApplicationsPage_DeleteTask_Title
source: Delete Task
zh_tw: 刪除任務

# AuthApplicationsPage_NewScope_Title
source: New Scope
zh_tw: 新增範圍

# AuthApplicationsPage_OperationIdLabel
source: Operation ID
zh_tw: 操作 ID

# AuthApplicationsPage_Properties
source: Properties
zh_tw: 屬性

# AuthApplicationsPage_RoleAssignment_AssignMembers
source: Assign Members
zh_tw: 指派成員

# AuthApplicationsPage_RoleAssignment_AssignMembersTitle
source: Assign Members to Role Assignment
zh_tw: 指派成員至角色指派

# AuthApplicationsPage_RoleAssignment_AssignTasksRoles
source: Assign Tasks/Roles
zh_tw: 指派任務/角色

# AuthApplicationsPage_RoleAssignment_EditPrompt
source: Edit role assignment
zh_tw: 編輯角色指派

# AuthApplicationsPage_RoleAssignment_EditTitle
source: Edit Role Assignment
zh_tw: 編輯角色指派

# AuthApplicationsPage_RoleAssignment_MembersAdded
source: Members added successfully.
zh_tw: 成員新增成功。

# AuthApplicationsPage_RoleAssignment_MembersAddFailed
source: Failed to add members.
zh_tw: 新增成員失敗。

# AuthApplicationsPage_RoleAssignment_UpdateFailed
source: Failed to update role assignment.
zh_tw: 更新角色指派失敗。

# AuthApplicationsPage_RoleAssignment_UpdateSuccess
source: Role assignment updated successfully.
zh_tw: 角色指派更新成功。

# AuthApplicationsPage_RoleAssignmentsHeader
source: Role Assignments
zh_tw: 角色指派

# AuthApplicationsPage_RolesHeader
source: Roles
zh_tw: 角色

# AuthApplicationsPage_ScopeProperties_Title
source: Scope Properties
zh_tw: 範圍屬性

# AuthApplicationsPage_ScopePropertiesTooltip
source: Edit scope properties
zh_tw: 編輯範圍屬性

# AuthApplicationsPage_ScopesHeader
source: Scopes
zh_tw: 範圍

# AuthApplicationsPage_Status_ApplicationUpdated
source: Application updated successfully.
zh_tw: 應用程式更新成功。

# AuthApplicationsPage_Status_ApplicationUpdateFailed
source: Failed to update application.
zh_tw: 更新應用程式失敗。

# AuthApplicationsPage_Status_GroupCreated
source: Group created successfully.
zh_tw: 群組建立成功。

# AuthApplicationsPage_Status_GroupDeleted
source: Group deleted successfully.
zh_tw: 群組刪除成功。

# AuthApplicationsPage_Status_GroupUpdated
source: Group updated successfully.
zh_tw: 群組更新成功。

# AuthApplicationsPage_Status_GroupUpdateFailed
source: Failed to update group.
zh_tw: 更新群組失敗。

# AuthApplicationsPage_Status_OperationCreated
source: Operation created successfully.
zh_tw: 操作建立成功。

# AuthApplicationsPage_Status_OperationDeleted
source: Operation deleted successfully.
zh_tw: 操作刪除成功。

# AuthApplicationsPage_Status_OperationUpdated
source: Operation updated successfully.
zh_tw: 操作更新成功。

# AuthApplicationsPage_Status_OperationUpdateFailed
source: Failed to update operation.
zh_tw: 更新操作失敗。

# AuthApplicationsPage_Status_RoleAssignmentCreated
source: Role assignment created successfully.
zh_tw: 角色指派建立成功。

# AuthApplicationsPage_Status_RoleAssignmentDeleted
source: Role assignment deleted successfully.
zh_tw: 角色指派刪除成功。

# AuthApplicationsPage_Status_RoleAssignmentUpdated
source: Role assignment updated successfully.
zh_tw: 角色指派更新成功。

# AuthApplicationsPage_Status_RoleAssignmentUpdateFailed
source: Failed to update role assignment: {0}
zh_tw: 更新角色指派失敗：{0}

# AuthApplicationsPage_Status_RoleCreated
source: Role created successfully.
zh_tw: 角色建立成功。

# AuthApplicationsPage_Status_RoleDeleted
source: Role deleted successfully.
zh_tw: 角色刪除成功。

# AuthApplicationsPage_Status_RoleUpdated
source: Role updated successfully.
zh_tw: 角色更新成功。

# AuthApplicationsPage_Status_RoleUpdateFailed
source: Failed to update role.
zh_tw: 更新角色失敗。

# AuthApplicationsPage_Status_ScopeCreated
source: Scope created successfully.
zh_tw: 範圍建立成功。

# AuthApplicationsPage_Status_ScopeDeleted
source: Scope deleted successfully.
zh_tw: 範圍刪除成功。

# AuthApplicationsPage_Status_ScopeUpdated
source: Scope updated successfully.
zh_tw: 範圍更新成功。

# AuthApplicationsPage_Status_ScopeUpdateFailed
source: Failed to update scope.
zh_tw: 更新範圍失敗。

# AuthApplicationsPage_Status_TaskCreated
source: Task created successfully.
zh_tw: 任務建立成功。

# AuthApplicationsPage_Status_TaskDeleted
source: Task deleted successfully.
zh_tw: 任務刪除成功。

# AuthApplicationsPage_Status_TaskUpdated
source: Task updated successfully.
zh_tw: 任務更新成功。

# AuthApplicationsPage_Status_TaskUpdateFailed
source: Failed to update task.
zh_tw: 更新任務失敗。

# AuthApplicationsPage_Tab_Definitions
source: Definitions
zh_tw: 定義

# AuthApplicationsPage_Tab_GroupsRoles
source: Groups & Roles
zh_tw: 群組與角色

# ScopesPage_AssignMembers_Title
source: Assign Members
zh_tw: 指派成員

# ScopesPage_DeleteGroup_Content
source: Are you sure you want to delete this group?
zh_tw: 您確定要刪除此群組嗎？

# ScopesPage_DeleteGroup_Title
source: Delete Group
zh_tw: 刪除群組

# ScopesPage_DeleteRole_Content
source: Are you sure you want to delete this role?
zh_tw: 您確定要刪除此角色嗎？

# ScopesPage_DeleteRole_Title
source: Delete Role
zh_tw: 刪除角色

# ScopesPage_DeleteRoleAssignment_Content
source: Are you sure you want to delete this role assignment?
zh_tw: 您確定要刪除此角色指派嗎？

# ScopesPage_DeleteRoleAssignment_Title
source: Delete Role Assignment
zh_tw: 刪除角色指派

# ScopesPage_DeleteScope
source: Delete Scope
zh_tw: 刪除範圍

# ScopesPage_DeleteScope_Content
source: Are you sure you want to delete this scope?
zh_tw: 您確定要刪除此範圍嗎？

# ScopesPage_DeleteScope_Title
source: Delete Scope
zh_tw: 刪除範圍

# ScopesPage_DeleteTask_Content
source: Are you sure you want to delete this task?
zh_tw: 您確定要刪除此任務嗎？

# ScopesPage_DeleteTask_Title
source: Delete Task
zh_tw: 刪除任務

# ScopesPage_Info_Message
source: Scopes allow you to define a subset of the application where roles and tasks can be assigned.
zh_tw: 範圍允許您定義應用程式的子集，其中可以指派角色和任務。

# ScopesPage_Info_Title
source: About Scopes
zh_tw: 關於範圍

# ScopesPage_Properties
source: Properties
zh_tw: 屬性

# ScopesPage_RoleAssignmentsHeader
source: Role Assignments
zh_tw: 角色指派

# ScopesPage_RoleDefinitionsHeader
source: Role Definitions
zh_tw: 角色定義

# ScopesPage_ScopeProperties_Title
source: Scope Properties
zh_tw: 範圍屬性

# ScopesPage_Status_GroupCreated
source: Group created successfully.
zh_tw: 群組建立成功。

# ScopesPage_Status_GroupDeleted
source: Group deleted successfully.
zh_tw: 群組刪除成功。

# ScopesPage_Status_GroupUpdated
source: Group updated successfully.
zh_tw: 群組更新成功。

# ScopesPage_Status_GroupUpdateFailed
source: Failed to update group.
zh_tw: 更新群組失敗。

# ScopesPage_Status_RoleAssignmentCreated
source: Role assignment created successfully.
zh_tw: 角色指派建立成功。

# ScopesPage_Status_RoleAssignmentDeleted
source: Role assignment deleted successfully.
zh_tw: 角色指派刪除成功。

# ScopesPage_Status_RoleAssignmentUpdated
source: Role assignment updated successfully.
zh_tw: 角色指派更新成功。

# ScopesPage_Status_RoleAssignmentUpdateFailed
source: Failed to update role assignment: {0}
zh_tw: 更新角色指派失敗：{0}

# ScopesPage_Status_RoleAssignmentMembersAdded
source: Members added to role assignment successfully.
zh_tw: 成員成功新增至角色指派。

# ScopesPage_Status_RoleAssignmentMembersAddFailed
source: Failed to add members to role assignment.
zh_tw: 新增成員至角色指派失敗。

# ScopesPage_Status_RoleCreated
source: Role created successfully.
zh_tw: 角色建立成功。

# ScopesPage_Status_RoleDeleted
source: Role deleted successfully.
zh_tw: 角色刪除成功。

# ScopesPage_Status_RoleUpdated
source: Role updated successfully.
zh_tw: 角色更新成功。

# ScopesPage_Status_RoleUpdateFailed
source: Failed to update role.
zh_tw: 更新角色失敗。

# ScopesPage_Status_ScopePropertiesUpdated
source: Scope properties updated successfully.
zh_tw: 範圍屬性更新成功。

# ScopesPage_Status_ScopePropertiesUpdateFailed
source: Failed to update scope properties.
zh_tw: 更新範圍屬性失敗。

# ScopesPage_Status_TaskCreated
source: Task created successfully.
zh_tw: 任務建立成功。

# ScopesPage_Status_TaskDeleted
source: Task deleted successfully.
zh_tw: 任務刪除成功。

# ScopesPage_Status_TaskUpdated
source: Task updated successfully.
zh_tw: 任務更新成功。

# ScopesPage_Status_TaskUpdateFailed
source: Failed to update task.
zh_tw: 更新任務失敗。

# AzMan_AccessDenied
source: Access denied. Please ensure you have sufficient permissions.
zh_tw: 存取被拒。請確認您有足夠的權限。

# RoleAssignmentPropertiesDialog_Title
source: {0} Properties
zh_tw: {0} 屬性

# RoleAssignmentPropertiesDialog_Tab_General
source: General
zh_tw: 一般

# RoleAssignmentPropertiesDialog_Tab_AssignedUsers
source: Assigned Users
zh_tw: 指派的使用者

# RoleAssignmentPropertiesDialog_Name_Header
source: Name
zh_tw: 名稱

# RoleAssignmentPropertiesDialog_Description_Header
source: Description
zh_tw: 描述

# RoleAssignmentPropertiesDialog_Description_Placeholder
source: Enter description...
zh_tw: 輸入描述...

# RoleAssignmentPropertiesDialog_NoMembers_Message
source: No users or groups are assigned to this role.
zh_tw: 沒有使用者或群組指派給此角色。

# RoleAssignmentPropertiesDialog_Error_AddUsersFailed
source: Failed to add users: {0}
zh_tw: 新增使用者失敗：{0}

# RoleAssignmentPropertiesDialog_Error_RemoveUserFailed
source: Failed to remove user: {0}
zh_tw: 移除使用者失敗：{0}

# AuthorizationRuleDialog_Title
source: Authorization Rule
zh_tw: 授權規則

# AuthorizationRuleDialog_ScriptFiles_Filter
source: Script Files
zh_tw: 腳本檔案

# AuthorizationRuleDialog_SelectScriptFile_Title
source: Select script file
zh_tw: 選取腳本檔案

# DefinitionAssignItemsDialog_Title_Format
source: Assign Items - {0}
zh_tw: 指派項目 - {0}

# DefinitionAssignItemsDialog_Header_Task
source: The tasks and operations that define this task:
zh_tw: 定義此工作的任務與操作：

# DefinitionAssignItemsDialog_Header_Role
source: The tasks and lower-level roles that define this role:
zh_tw: 定義此角色的任務與低階角色：

# DefinitionPropertiesDialog_Title_RoleDefinition
source: Role Definition Properties
zh_tw: 角色定義屬性

# DefinitionPropertiesDialog_Title_Task
source: Task Properties
zh_tw: 工作屬性

# DefinitionPropertiesDialog_Summary_Format
source: Roles: {0}, Tasks: {1}, Operations: {2}
zh_tw: 角色：{0}，任務：{1}，操作：{2}

# DefinitionPropertiesDialog_Action_ClearFromStore
source: Clear from store
zh_tw: 從儲存體清除

# DefinitionPropertiesDialog_Action_ReloadIntoStore
source: Reload into store
zh_tw: 重新載入至儲存體

# DefinitionPropertiesDialog_Action_NoAction
source: No action
zh_tw: 無動作

# DefinitionPropertiesDialog_Path_None
source: (none)
zh_tw: （無）

# GroupMembersDialog_BusinessRuleScript_Header
source: Business rule script
zh_tw: 商業規則腳本

# GroupMembersDialog_BusinessRuleScript_Title
source: Business Rule Script
zh_tw: 商業規則腳本

# GroupMembersDialog_Language_Header
source: Language
zh_tw: 語言

# StorePropertiesDialog_DefaultsSelected
source: Defaults selected
zh_tw: 已選取預設值

# StorePropertiesDialog_UpgradeSelected
source: Upgrade selected
zh_tw: 已選取升級

# StorePropertiesDialog_Error_AuthRuleTimeout
source: Authorization rule timeout must be greater than 0 when specified timeout mode is selected.
zh_tw: 選取指定逾時模式時，授權規則逾時必須大於 0。

# Common_FailedToOpenDialog_Format
source: Failed to open dialog: {0}
zh_tw: 開啟對話方塊失敗：{0}

# Common_FailedToAddUsers_Format
source: Failed to add users: {0}
zh_tw: 新增使用者失敗：{0}

# Common_FailedToRemoveUser_Format
source: Failed to remove user: {0}
zh_tw: 移除使用者失敗：{0}

# AuthorizationRuleDialog_ScriptSourceCode_Label
source: Script source code:
zh_tw: 腳本原始碼：

# AuthorizationRuleDialog_ScriptPath_Label
source: Script path:
zh_tw: 腳本路徑：

# AuthorizationRuleDialog_Browse_Button
source: Browse...
zh_tw: 瀏覽...

# AuthorizationRuleDialog_ScriptType_Label
source: Script type:
zh_tw: 腳本類型：

# AuthorizationRuleDialog_ReloadRule_Button
source: Reload Rule into Store
zh_tw: 重新載入規則至儲存體

# AuthorizationRuleDialog_ClearRule_Button
source: Clear Rule from Store
zh_tw: 從儲存體清除規則

# DefinitionAssignItemsDialog_Tab_Roles
source: Roles
zh_tw: 角色

# DefinitionAssignItemsDialog_Tab_Tasks
source: Tasks
zh_tw: 工作

# DefinitionAssignItemsDialog_Tab_Operations
source: Operations
zh_tw: 操作

# DefinitionPropertiesDialog_Tab_General
source: General
zh_tw: 一般

# DefinitionPropertiesDialog_Tab_Definition
source: Definition
zh_tw: 定義

# DefinitionPropertiesDialog_Name_Header
source: Name
zh_tw: 名稱

# DefinitionPropertiesDialog_Description_Header
source: Description
zh_tw: 描述

# DefinitionPropertiesDialog_AssignItems_Button
source: Assign items...
zh_tw: 指派項目...

# DefinitionPropertiesDialog_AuthorizationRule_Button
source: Authorization Rule...
zh_tw: 授權規則...

# EditItemDialog_GroupType_Bizrule
source: Business Rule
zh_tw: 商業規則

# GroupMembersDialog_Tab_General
source: General
zh_tw: 一般

# GroupMembersDialog_Tab_Query
source: Query
zh_tw: 查詢

# GroupMembersDialog_Tab_Exclusions
source: Exclusions
zh_tw: 排除項目

# GroupMembersDialog_Name_Header
source: Name
zh_tw: 名稱

# GroupMembersDialog_Description_Header
source: Description
zh_tw: 描述

# GroupMembersDialog_GroupType_Header
source: Group type
zh_tw: 群組類型

# GroupMembersDialog_LdapQuery_Header
source: LDAP query
zh_tw: LDAP 查詢

# GroupMembersDialog_WindowsMembers_Header
source: Members (Windows / Active Directory)
zh_tw: 成員 (Windows / Active Directory)

# GroupMembersDialog_AppGroupMembers_Header
source: Members (Authorization Manager application groups)
zh_tw: 成員 (授權管理員應用程式群組)

# GroupMembersDialog_WindowsExclusions_Header
source: Exclusions (Windows / Active Directory)
zh_tw: 排除項目 (Windows / Active Directory)

# GroupMembersDialog_AppGroupExclusions_Header
source: Exclusions (Authorization Manager application groups)
zh_tw: 排除項目 (授權管理員應用程式群組)

# StorePropertiesDialog_Tab_Limits
source: Limits
zh_tw: 限制

# StorePropertiesDialog_UpgradeSchema_Button
source: Upgrade schema to version 2.0
zh_tw: 升級結構描述至版本 2.0

# StorePropertiesDialog_SchemaUpgrade_Title
source: Schema upgrade
zh_tw: 結構描述升級

# StorePropertiesDialog_SchemaUpgrade_Message
source: This authorization store uses schema 1.0. Select this option to upgrade to schema 2.0.
zh_tw: 此授權儲存體使用結構描述 1.0。選取此選項以升級至結構描述 2.0。

# StorePropertiesDialog_AuthorizationRules_Header
source: Authorization rules
zh_tw: 授權規則

# StorePropertiesDialog_AuthRuleTimeout_Header
source: Authorization rule timeout
zh_tw: 授權規則逾時

# StorePropertiesDialog_MaxCachedAuthRules_Header
source: Maximum number of cached authorization rules
zh_tw: 快取授權規則的最大數目

# StorePropertiesDialog_LdapQueryTimeout_Header
source: LDAP query timeout
zh_tw: LDAP 查詢逾時

# StorePropertiesDialog_AuthRules_Disable
source: Disable
zh_tw: 停用

# StorePropertiesDialog_AuthRules_EnableNoTimeout
source: Enable with no timeout value
zh_tw: 啟用且無逾時值

# StorePropertiesDialog_AuthRules_EnableSpecifiedTimeout
source: Enable with specified timeout value
zh_tw: 啟用且指定逾時值

# StorePropertiesDialog_UseDefaultValues_Button
source: Use Default Values
zh_tw: 使用預設值

# StorePropertiesDialog_RuntimeAppInitAuditing
source: Runtime application initialization auditing
zh_tw: 執行階段應用程式初始化稽核

# StorePropertiesDialog_StoreChangeAuditing
source: Authorization store change auditing
zh_tw: 授權儲存體變更稽核

# GroupType_BusinessRuleAppGroup
source: Business Rule Application Group
zh_tw: 商業規則應用程式群組

# GroupType_AppBasicGroup
source: Application Basic Group
zh_tw: 應用程式基本群組

# GroupType_LdapQueryGroup
source: LDAP Query Group
zh_tw: LDAP 查詢群組

# GroupType_Unknown
source: Unknown
zh_tw: 未知

# Error_FailedToCloseStore
source: Failed to close store: {0}
zh_tw: 關閉儲存體失敗：{0}

# Error_StoreFileNotFound
source: Store file not found: {0}. The store has been closed.
zh_tw: 找不到儲存體檔案：{0}。儲存體已關閉。

# Error_FileNotFound
source: The specified file was not found.
zh_tw: 找不到指定的檔案。

# Error_PathNotFound
source: The specified path was not found.
zh_tw: 找不到指定的路徑。

# Error_NetworkPathNotFound
source: Network path not found. Please check that the path is correct and accessible.
zh_tw: 找不到網路路徑。請檢查路徑是否正確且可存取。

# Error_FileAlreadyExists
source: The file already exists.
zh_tw: 檔案已存在。

# Error_ElementNotFound
source: Element not found.
zh_tw: 找不到元素。

# Error_InterfaceNotSupported
source: Interface not supported. Please ensure AzMan components are properly installed.
zh_tw: 不支援介面。請確認已正確安裝 AzMan 元件。

# Error_InvalidClassString
source: Invalid class string. AzMan COM component may not be registered.
zh_tw: 無效的類別字串。AzMan COM 元件可能未註冊。

# Error_ClassNotRegistered
source: Class not registered. Please ensure AzMan components are installed.
zh_tw: 類別未註冊。請確認已安裝 AzMan 元件。

# BizRuleValidator_Error_EmptyScript
source: Script cannot be empty.
zh_tw: 腳本不能為空白。

# BizRuleValidator_Error_InvalidLanguage
source: Invalid script language: '{0}'. Must be 'VBScript' or 'JScript'.
zh_tw: 無效的腳本語言：'{0}'。必須是 'VBScript' 或 'JScript'。

# BizRuleValidator_Warning_NoAzBizRuleContext
source: Script does not reference 'AzBizRuleContext'. Business rules typically use this object to set the authorization result.
zh_tw: 腳本未參考 'AzBizRuleContext'。商業規則通常使用此物件來設定授權結果。

# BizRuleValidator_Warning_NoBusinessRuleResult
source: Script does not set 'BusinessRuleResult'. The rule may not affect authorization decisions.
zh_tw: 腳本未設定 'BusinessRuleResult'。此規則可能不會影響授權決策。

# BizRuleValidator_Error_UnbalancedSubEndSub
source: Unbalanced Sub/End Sub: {0} Sub(s) but {1} End Sub(s).
zh_tw: Sub/End Sub 不平衡：{0} 個 Sub 但有 {1} 個 End Sub。

# BizRuleValidator_Error_UnbalancedFunctionEndFunction
source: Unbalanced Function/End Function: {0} Function(s) but {1} End Function(s).
zh_tw: Function/End Function 不平衡：{0} 個 Function 但有 {1} 個 End Function。

# BizRuleValidator_Warning_UnbalancedIfEndIf
source: Possible unbalanced If/End If: {0} If(s) but {1} End If(s).
zh_tw: 可能的 If/End If 不平衡：{0} 個 If 但有 {1} 個 End If。

# BizRuleValidator_Error_UnbalancedBraces
source: Unbalanced braces: {0} opening but {1} closing.
zh_tw: 大括號不平衡：{0} 個開啟但有 {1} 個關閉。

# BizRuleValidator_Error_UnbalancedParentheses
source: Unbalanced parentheses: {0} opening but {1} closing.
zh_tw: 括號不平衡：{0} 個開啟但有 {1} 個關閉。

# BizRuleValidator_Warning_DoubleSemicolons
source: Double semicolons detected. This may indicate missing code.
zh_tw: 偵測到雙分號。這可能表示缺少程式碼。

# BizRuleValidator_SampleDescription
source: Sample business rule
zh_tw: 範例商業規則

# Common_OK
source: OK
zh_tw: 確定

# Common_Cancel
source: Cancel
zh_tw: 取消

# Common_Save
source: Save
zh_tw: 儲存

# Error_StoreNotOpen
source: Store '{0}' is not open. Please open the store first.
zh_tw: 儲存體 '{0}' 未開啟。請先開啟儲存體。
